/*
*********************************************************************************************************
*
*	模块名称 : BSP模块
*	文件名称 : bsp.h
*	说    明 : 这是底层驱动模块所有的h文件的汇总文件。 应用程序只需 #include bsp.h 即可，
*			  不需要#include 每个模块的 h 文件
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _APP_H_
#define _APP_H

/* 定义 Function Module Layer 版本号 */
#define __APP_VERSION		"1.0"


  
/* 通过取消注释或者添加注释的方式控制是否包含各函数模块 */
#include "fml.h"
#include "app_led.h"

/* 提供给其他C文件调用的函数 */
void APP_Init(void);


#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
