/*
*********************************************************************************************************
*
*	模块名称 : LED指示灯驱动模块
*	文件名称 : bsp_led.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __FML_LED_H
#define __FML_LED_H

/* 供外部调用的函数声明 */
void APP_LED_Test(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
